[{"id": 1634245908190601231, "date": "2023-03-10T17:32:41+00:00", "text": "For Women's History Month, I wanted to share the stories of Cary and Sharika—two women who've been building the Obama Presidential Center on the South Side of Chicago. I met them last year while visiting the site. Read their stories here: https://t.co/iSIl7dGFp8", "username": "BarackObama", "conversationId": 1634245908190601231, "sentiment": 1}, {"id": 1634207825927733248, "date": "2023-03-10T15:01:22+00:00", "text": ".@DemRedistrict hasn’t just been fighting for fair maps — they’ve been fighting to give people everywhere a fair shot. Our democracy is stronger today because of their hard work. https://t.co/ZudD9hrqTL", "username": "BarackObama", "conversationId": 1634207825927733248, "sentiment": 1}, {"id": 1633574144791937026, "date": "2023-03-08T21:03:21+00:00", "text": "This International Women's Day, read how @MichelleObama, @MelindaGates and Amal Clooney are working together to help end child marriage. I'm proud of the work @GirlsAlliance is doing to take on issues like this to create a better world for girls everywhere.https://t.co/m49a4abtjk", "username": "BarackObama", "conversationId": 1633574144791937026, "sentiment": 1}, {"id": 1632218360992743426, "date": "2023-03-05T03:15:57+00:00", "text": "Judy Heumann dedicated her life to the fight for civil rights—starting as a young organizer at Camp Jened and later helping lead the disability rights movement. Michelle and I were fortunate to work with Judy over the years, and are thinking of her family and friends. https://t.co/ODXtMMWfnV", "username": "BarackObama", "conversationId": 1632218360992743426, "sentiment": 1}, {"id": 1631293304322097154, "date": "2023-03-02T14:00:06+00:00", "text": "“Fired up. Ready to go!” Edith Childs understands the power of a single voice, and she used those words to light up a room during my campaign stop in Greenwood, SC back in 2007.\n\nI recently caught up with Edith, who just retired after 24 years in public service. Take a look: https://t.co/IhW6pqnAQR", "username": "BarackObama", "conversationId": 1631293304322097154, "sentiment": 1}, {"id": 1630615307759894638, "date": "2023-02-28T17:05:59+00:00", "text": "Real change happens one person, one community, one connection at a time. If you’re an emerging leader in Chicago, Detroit, or Jackson — I hope you’ll check out this new initiative to bring people from different backgrounds together to help solve local problems.", "username": "BarackObama", "conversationId": 1630615307759894638, "sentiment": 1}, {"id": 1630336174509154304, "date": "2023-02-27T22:36:48+00:00", "text": "I’m so proud of the work we’ve done at @MBK_Alliance, and the young men who’ve been a part of this community. And we're not done yet. We’ll keep working to make sure even more boys and young men reach their full potential.", "username": "BarackObama", "conversationId": 1630336174509154304, "sentiment": 1}, {"id": 1628055907040124928, "date": "2023-02-21T15:35:50+00:00", "text": "I’m excited to announce that 105 inspiring young people from across Africa, Asia-Pacific, and Europe will be joining the @ObamaFoundation Leaders program. \n\nI am so proud of all of you, and I can't wait to see what you do. https://t.co/ifQMoumj2Q", "username": "BarackObama", "conversationId": 1628055907040124928, "sentiment": 1}, {"id": 1627361243689254914, "date": "2023-02-19T17:35:30+00:00", "text": "Dr. Blank's four years serving in my administration was just one part of her extraordinary life. Whether in government or academia, she devoted her career to reducing inequality and increasing opportunities for others, and made everyone around her better. \nhttps://t.co/wMGjRAacfN", "username": "BarackObama", "conversationId": 1627361243689254914, "sentiment": 1}, {"id": 1625495400470958082, "date": "2023-02-14T14:01:18+00:00", "text": "Happy Valentine’s Day to the one and only, @MichelleObama. You make every day feel like an adventure. https://t.co/NfywjrrDxb", "username": "BarackObama", "conversationId": 1625495400470958082, "sentiment": 1}, {"id": 1625143593286438912, "date": "2023-02-13T14:43:21+00:00", "text": "Congratulations to the Kansas City @Chiefs, Patrick Mahomes, Travis Kelce and Andy Reid for a great Super Bowl win and for sustained excellence. And shout out to the @Eagles and Jalen Hurts—outstanding competitors with a bright future.", "username": "BarackObama", "conversationId": 1625143593286438912, "sentiment": 1}, {"id": 1622770990710235136, "date": "2023-02-07T01:35:28+00:00", "text": "The scale of devastation after the earthquakes in Türkiye and Syria is almost unimaginable. Michelle and I are thinking of the thousands of people who have been affected, including Syrian refugees. Here are some resources for anyone looking to help.", "username": "BarackObama", "conversationId": 1622770990710235136, "sentiment": 1}, {"id": 1620905250742730756, "date": "2023-02-01T22:01:41+00:00", "text": "Black History Month is about the shared experience of all Black Americans whose lives have shaped, challenged, and ultimately strengthened America.", "username": "BarackObama", "conversationId": 1620905250742730756, "sentiment": 1}]