[{"id": 1634053040348053506, "date": "2023-03-10T04:46:18+00:00", "text": "As Art Laffer postulates in his latest book, “Taxes Have Consequences”. Given Biden’s latest budget proposals, the great migration to low or no tax states like FL and TN and, in my view, to countries hungry for innovation in Asia and elsewhere is likely to accelerate.", "username": "CathieDWood", "conversationId": 1634053040348053506, "sentiment": 1}, {"id": 1633631156749910018, "date": "2023-03-09T00:49:53+00:00", "text": "Provocative. During the last few years, I have expressed my frustration with Google search, deeming it primitive AI, notwithstanding Alphabet’s DeepMind expertise. OpenAI/Microsoft’s ChatGPT is the “iPhone moment” of this decade, changing everything. Disruptive innovation!", "username": "CathieDWood", "conversationId": 1633631156749910018, "sentiment": 0}, {"id": 1633493609306619904, "date": "2023-03-08T15:43:19+00:00", "text": "Important perspective.", "username": "CathieDWood", "conversationId": 1633493609306619904, "sentiment": 1}, {"id": 1631526746620084224, "date": "2023-03-03T05:27:43+00:00", "text": "On @CNBC this week, @SaraEisen asked if #Tesla is cutting prices in response to competition. After investor day, @skorusARK illustrated that Tesla is passing along drivetrain cost declines that will cut the price of the Model 3 in half to $25,000, undercutting competition!", "username": "CathieDWood", "conversationId": 1631526746620084224, "sentiment": 0}, {"id": 1631130113554235392, "date": "2023-03-02T03:11:38+00:00", "text": "Welcome to @ARKInvest, Daniel! We are delighted that you will be working with @TashaARK and @skorusARK to  research autonomous mobility, the biggest technologically-enabled revenue opportunity that we expect to evolve during the next five to ten years.", "username": "CathieDWood", "conversationId": 1631130113554235392, "sentiment": 1}, {"id": 1626809644197769216, "date": "2023-02-18T05:03:38+00:00", "text": "One more thought: @ARKInvest has a five year investment time horizon. Now that the most brutal interest rate increase in history is near an end, growth stocks in general and innovation-based strategies in particular should make up for lost time.", "username": "CathieDWood", "conversationId": 1626809644197769216, "sentiment": 0}, {"id": 1626807111232413696, "date": "2023-02-18T04:53:34+00:00", "text": "Thank you, @EricBalchunas, for defending active equity management. Upon hearing why I founded @ARKInvest in 2014, a friend who was not in the investment business said, “Oh, you mean the future of investing is investing in the future?” Yes! Please see ARK’s Big Ideas 2023.", "username": "CathieDWood", "conversationId": 1626807111232413696, "sentiment": 1}, {"id": 1626801179777765377, "date": "2023-02-18T04:30:00+00:00", "text": "Think about AI as the assembly line for knowledge workers! Roughly 100 years ago, the assembly line turbocharged the Industrial Revolution. Today, AI is turbocharging the digital revolution, not only for enterprises but also for consumers.", "username": "CathieDWood", "conversationId": 1626801179777765377, "sentiment": 0}, {"id": 1626799541935648769, "date": "2023-02-18T04:23:29+00:00", "text": "Charlie Munger and many on Wall Street do not understand that passing along the lower costs associated with technologically-enabled innovation, in #Tesla’s case batteries and drivetrains, will cause a boom in unit demand, discrediting the Keynesian/Fed’s Phillips Curve model.", "username": "CathieDWood", "conversationId": 1626799541935648769, "sentiment": 0}, {"id": 1625666819918004224, "date": "2023-02-15T01:22:27+00:00", "text": "The 10-fold increase in lithium prices during the past two years is a clarion call for more production and supply. Now that CATL in China, Samsung and LG in Korea, and major auto makers have committed to the EV revolution, odds are high that lithium will be in excess supply…", "username": "CathieDWood", "conversationId": 1625666819918004224, "sentiment": -1}, {"id": 1624258280812945408, "date": "2023-02-11T04:05:26+00:00", "text": "So, activity moves to offshore exchanges or to self custody, self sovereignty, and self control? Decentralization wins. Great! Given regulatory arbitrage, however, US exchanges lose to foreign exchanges, not so good for US competitiveness in the crypto revolutions, in my view.", "username": "CathieDWood", "conversationId": 1624258280812945408, "sentiment": 0}, {"id": 1623888358656147456, "date": "2023-02-10T03:35:29+00:00", "text": ".@ARKInvest is thrilled that Emmaline and Camilla, students participating in the pilot sixth grade science curriculum powered by our research at the Pinellas Park Middle School, received the FAST award for their science project and will compete at the Florida State Science Fair!", "username": "CathieDWood", "conversationId": 1623888358656147456, "sentiment": 1}, {"id": 1623151071760637952, "date": "2023-02-08T02:45:46+00:00", "text": "Connected TV should be a prime beneficiary of the $70 billion shift in advertising dollars from linear to digital TV in the US and the $170 billion shift globally. Good catch @andrewkimARK!", "username": "CathieDWood", "conversationId": 1623151071760637952, "sentiment": 1}, {"id": 1621736241107550208, "date": "2023-02-04T05:03:44+00:00", "text": "‼️", "username": "CathieDWood", "conversationId": 1621736241107550208, "sentiment": -1}, {"id": 1621644756576075776, "date": "2023-02-03T23:00:13+00:00", "text": "Bitcoin Monthly includes several important charts suggesting seller exhaustion and robust fundamentals. Thank you @dpuellARK  and @yassineARK!", "username": "CathieDWood", "conversationId": 1621644756576075776, "sentiment": 1}, {"id": 1620624262792093696, "date": "2023-02-01T03:25:08+00:00", "text": "Today, @ARKInvest published the seventh edition of Big Ideas 2023. According to our research, the market value of disruptive innovation platforms could scale 40% at an annual rate during this cycle, from $13 trillion today to $200 trillion by 2030.\n\nhttps://t.co/CC03vRWyzA", "username": "CathieDWood", "conversationId": 1620624262792093696, "sentiment": -1}]